Revit 2017 API
PipingSystem.Flow Property
 The flow of this piping system
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This property is obsolete in Revit 2017. Please use GetFlow method instead.")]
public double Flow { get; }
Visual Basic
<ObsoleteAttribute("This property is obsolete in Revit 2017. Please use GetFlow method instead.")> _
Public ReadOnly Property Flow As Double
	Get
Visual C++
[ObsoleteAttribute(L"This property is obsolete in Revit 2017. Please use GetFlow method instead.")]
public:
property double Flow {
	double get ();
}
See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace